import React from "react";
import Poetry from "./Poetry";
import Wrapper from "../../Components/UI/wrapper";
import "./poems.css";
const DUMMY_POEMS = [
  {
    id: 0,
    poetry: [
      "دیده دریا کنم و صبر به صحرا فکنم",
      "و اندر این کار دل خویش به دریا فکنم",
      "از دل تنگ گنهکار برآرم آهی ",
      "کآتش اندر گنه آدم و حوا فکنم",
    ],
    mean: "افسوس گذشته و اشتباهاتی که مرتکب شده اید فکر شما را پریشان و آشفته کرده و بابت آن بسیار ناراحت هستید. اما چاره کار حسرت خوردن نیست و فایده ای نخواهد داشت",
  },
  {
    id: 1,
    poetry: [
      "شکفته شد گل حمرا و گشت بلبل مست",
      "صلای سرخوشی ای صوفیان باده پرست",
      "اساس توبه که در محکمی چو سنگ نمود ",
      "ببین که جام زجاجی چه طرفه‌اش بشکست",
    ],
    mean: "زندگی شما بر پایه میزان تلاش و همتی که دارید بنا شده است. برای رسیدن به یار و مقصودتان از هیچ تلاشی فروگذار نکرده و با تمام توان جلو بروید",
  },
  {
    id: 2,
    poetry: [
      "کی شعر تر انگیزد خاطر که حزین باشد",
      "یک نکته از این معنی گفتیم و همین باشد",
      "از لعل تو گر یابم انگشتری زنهار ",
      "صد ملک سلیمانم در زیر نگین باشد",
    ],
    mean: "اندوهگین نباشید، با غم و غصه نمی توانید تصمیم درست بگیرید. از روزهای ناخوشی گله مند نباشید که گذرا هستند و در مقابل آن ها باید صبوری پیشه کنید. با شکیبایی دشمنان ستیزه جو به دوستان جانی تبدیل می شوند",
  },
  {
    id: 3,
    poetry: [
      "ساقی بیار باده که ماه صیام رفت",
      "درده قدح که موسم ناموس و نام رفت",
      "وقت عزیز رفت بیا تا قضا کنیم ",
      "عمری که بی حضور صراحی و جام رفت",
    ],
    mean: "قدر روزهای عمر را ندانسته و آن را به بطالت گذرانده اید. غرور بیجا و تکبر باعث شده نه از گذشته خود متاعی باارزش به امروز بیاورید نه برای آینده برنامه درستی داشته باشید",
  },
];
function Poems() {
  return (
    <div className="poemsSection">
      <Wrapper>
        <Poetry poems={DUMMY_POEMS} />
      </Wrapper>
    </div>
  );
}

export default Poems;
